package by.htp.Task01.main;

//Task 01 \\ 3 \\ Вывсти на экран текст

public class Zad3Text {
	public static void main(String[] args) {
		System.out.println("Пройдет много лет, и полковник Аурелиано Буэндиа, стоя  стены в ожидании расстрела,");
		System.out.println("вспомнит тот далекий вечер, когда отец взял его с собой посмотреть на лед. Макондо было");
		System.out.println("тогда небольшим селением с двумя десятами хижин, выстроенных из глины и бамбука на");
		System.out.println("берегу реки, которая мчала свои прозрачные воды ...");
	}

}
