package by.htp.Task02.main;

// Task 02 \\ 10 \\ С помощью оператора while напишите программу вывода всех четных чисел в диапазоне от 2 до 100 включительно.

import java.util.Scanner;

public class Example10 {
	public static void main(String [] args) {
		 
		 int a = 2;

		 while(a<=100) {
			 System.out.println(" \\"+a); 
			 a = a+2;
		 }

	 }

}
